# въвеждане на променивите x, y и h
# изичисляване площ на стените ( x * x * 2 - 1.2 * 2 ) + ( x * y * 2 - 1.5 * 1.5 * 2)
# изчисляване площ на покрив ( 2 * x * y + x * h / 2 )
# зелено стени = площ стени / 3.4
# червено покрив = площ покрив / 4.3
# принт зелена боя и червена боя закръглено до 2 знак

x = float(input())
y = float(input())
h = float(input())

walls = ( x * x * 2 - 1.2 * 2 ) + ( x * y * 2 - 1.5 * 1.5 * 2)
roof = ( 2 * x * y + 2 * x * h / 2 )
green_paint = walls / 3.4
red_paint = roof / 4.3
print(f"{green_paint:.2f}")
print(f"{red_paint:.2f}")

